/****************************************************************/
/*                                                              */
/*  file: filarscope.c                                          */
/*                                                              */
/* This program allows to access the resources of a FILAR       */
/* card in a user friendly way and includes some test routines  */
/*                                                              */
/*  Author: Markus Joos, CERN-EP                                */
/*                                                              */
/*  14. Jun. 02  MAJO  created                                  */
/*                                                              */
/****************C 2002 - A nickel program worth a dime**********/

#include <unistd.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <sys/types.h>
#include <signal.h>
#include "rcc_error.h"
#include "io_rcc.h"
#include "cmem_rcc.h"
#include "tstamp.h"
#include "get_input.h"
#include "time.h"

#ifdef DEBUG
  #define debug(x) printf x
#else
  #define debug(x)
#endif

/*special prototypes*/
//extern ReturnCode DumpDesc(void);

/*constants*/
#define MAXBUF   33
#define CHANNELS 5              /*we will not use channel[0]*/
#define BUFSIZE  (256*1024)       /*bytes - changed from '16*1024' by jrhall*/
#define PREFILL  0xfeedbabe
#define RECEIVED_DATA   0			/* baddatas[RECEIVED_DATA][EXPECTED_DATA] array index */
#define EXPECTED_DATA 	1			/* baddatas[][] array index */
#define DATA   0			/* CSM Data array index */
#define CNT 	1			/* CSM Data array index */
#define FLAG	2			/* CSM Data array index */
#define INDEX 		2			/* baddatas[][] index of bad data in data buffer*/

/*types*/
typedef struct
{
unsigned int ocr;       /*0x000*/
unsigned int osr;       /*0x004*/
unsigned int imask;     /*0x008*/
unsigned int fifostat;  /*0x00c*/
unsigned int scw;       /*0x010*/
unsigned int ecw;       /*0x014*/
unsigned int testin;    /*0x018*/
unsigned int d1[57];    /*0x01c-0x0fc*/
unsigned int req1;      /*0x100*/
unsigned int ack1;      /*0x104*/
unsigned int d2[2];     /*0x108-0x10c*/
unsigned int req2;      /*0x110*/
unsigned int ack2;      /*0x114*/
unsigned int d3[2];     /*0x118-0x11c*/
unsigned int req3;      /*0x120*/
unsigned int ack3;      /*0x124*/
unsigned int d4[2];     /*0x128-0x12c*/
unsigned int req4;      /*0x130*/
unsigned int ack4;      /*0x134*/
unsigned int d5[2];     /*0x138-0x13c*/
}T_filar_regs;



/*globals*/
static unsigned int cont, first_event, shandle;
static unsigned int sreg, offset, prefill=0x00000000;
static T_filar_regs *filar;
static unsigned int pcidefault[16]=
  {
  0x001410dc, 0x00800000, 0x02800000, 0x0000ff00, 0xfffffc00, 0x00000000, 0x00000000, 0x00000000,
  0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x000001ff
  };
static int bhandle[CHANNELS][MAXBUF],  paddr[CHANNELS][MAXBUF], uaddr[CHANNELS][MAXBUF];
static int active[CHANNELS];
static int bfree[CHANNELS] = {0, MAXBUF, MAXBUF, MAXBUF, MAXBUF};
static int nextbuf[CHANNELS] = {0, 0, 0, 0, 0};
static struct sigaction sa;
static struct tm current_time;


/*****************************/
void SigQuitHandler(int signum)
/*****************************/
{
  cont=0;
  debug(("SigQuitHandler: ctrl+// received\n"));
}


/********************/
int filar_map(int occ)
/********************/
{
