/****************************************************************/
/*                                                              */
/*  file: filarscope.c                                          */
/*                                                              */
/* This program allows to access the resources of a FILAR       */
/* card in a user friendly way and includes some test routines  */
/*                                                              */
/*  Author: Markus Joos, CERN-EP                                */
/*                                                              */
/*  14. Jun. 02  MAJO  created                                  */
/*                                                              */
/****************C 2003 - A nickel program worth a dime**********/

#include <unistd.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <fcntl.h>
#include <sys/stat.h>
#include <sys/types.h>
#include <signal.h>
#include "rcc_error/rcc_error.h"
#include "io_rcc/io_rcc.h"
#include "cmem_rcc/cmem_rcc.h"
#include "rcc_time_stamp/tstamp.h"
#include "ROSGetInput/get_input.h"

/*prototypes*/
void SigQuitHandler(int signum);
int dumpmem(void);
int filar_map(int occ);
int setlat();
int filar_unmap(void);
int dumpconf(void);
int setreq(int channel, int number);
int setocrp(void);
int setpci(void);
int setti(void);
int setim(void);
int setreg(void);
int setirq(void);
int uio_init(void);
int uio_exit(void);
int getbuf(int channel, int mode);
int retbuf(int channel, int mode);
int readack(void);
int dumpbuff(void);
int cardreset(void);
int linkreset(void);
int mainhelp(void);
void SLIDASDataCheck1(u_int *bptr, int w, int chan);
void SLIDASDataCheck2(u_int *bptr, int w, int chan);
void SLIDASDataCheck3(u_int *bptr, int w, int chan);
void SLIDASDataCheck4(u_int *bptr, int w, int chan);
void SLIDASDataCheck8(u_int *bptr, int w, int chan);
int slidastest(void);
int filarconf(void);
int dmaprot(void);
int dma_menu(void);
int dmaflush(void);
int recorddata(void);

/*constants*/
#define MAXBUF     33
#define CHANNELS   5              /*we will not use channel[0]*/
#define BUFSIZE    (16*1024)      /*bytes*/
#define PREFILL    0xfeedbabe
#define REQBUFSIZE 0x1000
#define ACKBUFSIZE 0x1000

/*types*/
typedef struct
{
  u_int ocr;       /*0x000*/
  u_int osr;       /*0x004*/
  u_int imask;     /*0x008*/
  u_int fifostat;  /*0x00c*/
  u_int scw;       /*0x010*/
  u_int ecw;       /*0x014*/
  u_int testin;    /*0x018*/
  u_int reqadd;    /*0x01c*/
  u_int blkctl;    /*0x020*/
  u_int ackadd;    /*0x024*/
  u_int efstatr;   /*0x028*/
  u_int efstata;   /*0x02c*/
  u_int d1[52];    /*0x030-0x0fc*/
  u_int req1;      /*0x100*/
  u_int ack1;      /*0x104*/
  u_int d2[2];     /*0x108-0x10c*/
  u_int req2;      /*0x110*/
  u_int ack2;      /*0x114*/
  u_int d3[2];     /*0x118-0x11c*/
  u_int req3;      /*0x120*/
  u_int ack3;      /*0x124*/
  u_int d4[2];     /*0x128-0x12c*/
  u_int req4;      /*0x130*/
  u_int ack4;      /*0x134*/
  u_int d5[2];     /*0x138-0x13c*/
} T_filar_regs;


/*globals*/
static u_int cont, first_event, shandle, offset;
static u_long sreg;
static volatile T_filar_regs *filar;
static u_int pcidefault[16] =
{
  0x001410dc, 0x00800000, 0x02800000, 0x0000ff00, 0xfffffc00, 0x00000000, 0x00000000, 0x00000000,
  0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x000001ff
};
static u_long reqpaddr, paddr[CHANNELS][MAXBUF], uaddr[CHANNELS][MAXBUF], requaddr, ackpaddr, ackuaddr;
static int bhandle[CHANNELS][MAXBUF], ackbufhandle, reqbufhandle;
static int active[CHANNELS];
static int bfree[CHANNELS] = {0, MAXBUF, MAXBUF, MAXBUF, MAXBUF};
static int nextbuf[CHANNELS] = {0, 0, 0, 0, 0};
static struct sigaction sa;


/*****************************/
void SigQuitHandler(int signum)
/*****************************/
{
  cont=0;
}


/********************/
int filar_map(int occ)
/********************/
{
  u_int eret, pciaddr;

  eret = IO_Open();
